# 英文數字轉換表
# IO

s = input()
area = {
    'A' : 10,   # 台北市
    'B' : 11,   # 台中市
    'C' : 12,   # 基隆市
    'D' : 13,   # 台南市
    'E' : 14,   # 高雄市
    'F' : 15,   # 新北市
    'G' : 16,   # 宜蘭縣
    'H' : 17,   # 桃園縣
    'I' : 34,   # 嘉義市
    'J' : 18,   # 新竹縣
    'K' : 19,   # 苗栗縣
    'L' : 20,   # 台中縣
    'M' : 21,   # 南投縣
    'N' : 22,   # 彰化縣
    'O' : 35,   # 新竹市
    'P' : 23,   # 雲林縣
    'Q' : 24,   # 嘉義縣
    'R' : 25,   # 台南縣
    'S' : 26,   # 高雄縣
    'T' : 27,   # 屏東縣
    'U' : 28,   # 花蓮縣
    'V' : 29,   # 台東縣
    'W' : 32,   # 金門縣
    'X' : 30,   # 澎湖縣
    'Y' : 31,   # 陽明山
    'Z' : 33,   # 連江縣
}

code = area[s[0]]
tens = code // 10
ones = code % 10

total = tens + ones * 9 + int(s[9])

for i in range(1,9):
    total += int(s[i]) * (9 - i)

print("real" if total % 10 == 0 else "fake")

